# 5. Провести EDA и вывести какие-то умозаключения и посмотреть на распределения признаков, на корреляции, на выбросы.

# 6. Подумать над вариантом модели, для того чтобы решить задачу (либо ансамблем моделей)

print('Так как n << m, лучше использовать логистическую регрессию, либо SMV without kernel.')

# 7. Подумать нужно ли применять Unsupervised learning подход для решения задачи?
# Неоходима ли дополнительная информация?

# 8. Обучить модель и вывести валидационный скор по метрике качества.
